[options]
mode prove
depth 6

[engines]
smtbmc z3

[script]
read_verilog -formal -sv hardware/designs/sovryn_pan_stem_systolic_array_4x4_baseline.v hardware/formal/systolic_array_4x4/systolic_array_4x4_formal.sv
prep -top sovryn_pan_stem_systolic_array_4x4_formal
async2sync
opt_clean

[files]
hardware/designs/sovryn_pan_stem_systolic_array_4x4_baseline.v
hardware/formal/systolic_array_4x4/systolic_array_4x4_formal.sv
