[options]
mode prove
depth 6

[engines]
smtbmc z3

[script]
read_verilog -formal -sv hardware/designs/sovryn_pan_stem_mac_unit_baseline.v hardware/formal/mac_unit/mac_unit_formal.sv
prep -top sovryn_pan_stem_mac_unit_formal
async2sync
opt_clean

[files]
hardware/designs/sovryn_pan_stem_mac_unit_baseline.v
hardware/formal/mac_unit/mac_unit_formal.sv
