[options]
mode prove
depth 3

[engines]
smtbmc z3

[script]
read_verilog -formal -sv hardware/designs/sovryn_pan_stem_systolic_array_32x32_baseline.v hardware/formal/systolic_array_32x32/systolic_array_32x32_formal.sv
prep -top sovryn_pan_stem_systolic_array_32x32_formal
async2sync
opt_clean

[files]
hardware/designs/sovryn_pan_stem_systolic_array_32x32_baseline.v
hardware/formal/systolic_array_32x32/systolic_array_32x32_formal.sv
