[options]
mode bmc
depth 8

[engines]
smtbmc z3

[script]
read_verilog -formal -sv hardware/designs/sovryn_pan_stem_npu_array_v3_seed_b_min_baseline.v hardware/formal/npu_array_v3_seed_b_min/npu_array_v3_seed_b_min_formal.sv
prep -top sovryn_pan_stem_npu_array_v3_seed_b_min_formal
async2sync
opt_clean

[files]
hardware/designs/sovryn_pan_stem_npu_array_v3_seed_b_min_baseline.v
hardware/formal/npu_array_v3_seed_b_min/npu_array_v3_seed_b_min_formal.sv
