[options]
mode bmc
depth 8

[engines]
smtbmc z3

[script]
read_verilog -formal -sv hardware/designs/sovryn_pan_stem_npu_array_v4_seed_b_baseline.v hardware/formal/npu_array_v4_seed_b/npu_array_v4_seed_b_formal.sv
prep -top sovryn_pan_stem_npu_array_v4_seed_b_formal
async2sync
opt_clean

[files]
hardware/designs/sovryn_pan_stem_npu_array_v4_seed_b_baseline.v
hardware/formal/npu_array_v4_seed_b/npu_array_v4_seed_b_formal.sv
