[options]
mode prove
depth 5

[engines]
smtbmc z3

[script]
read_verilog -formal -sv hardware/designs/sovryn_pan_stem_npu_cluster_baseline.v hardware/formal/npu_cluster/npu_cluster_formal.sv
prep -top sovryn_pan_stem_npu_cluster_formal
async2sync
opt_clean

[files]
hardware/designs/sovryn_pan_stem_npu_cluster_baseline.v
hardware/formal/npu_cluster/npu_cluster_formal.sv
